<!DOCTYPE html>
<!-- saved from url=(0048)file:///C:/Users/User/Desktop/Book%20record.html -->
<html><head><meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
    <title>Book Record</title>
  </head>
  <body>
    <h1>Book Record</h1>
    <form onsubmit="return addBook()">
      <label>Title:</label>
      <input type="text" id="titleInput" required=""><br>

      <label>Author:</label>
      <input type="text" id="authorInput" required=""><br>

      <label>Publisher:</label>
      <input type="text" id="publisherInput" required=""><br>

      <label>Total number of pages:</label>
      <input type="number" id="pagesInput" required=""><br>

      <label>Year of Publication:</label>
      <input type="number" id="yearInput" required=""><br>

      <label>Summary:</label>
      <textarea id="summaryInput" required="" style="width: 1253px; height: 173px;"></textarea><br>

      <button type="submit">Add Book</button>
    </form>

    <br>

    <input type="text" id="searchInput" onkeyup="searchBook()" placeholder="Search by title...">

    <br>

    <table id="bookTable">
      <thead>
        <tr>
          <th>Title</th>
          <th>Author</th>
          <th>Publisher</th>
          <th>Total number of pages</th>
          <th>Year of Publication</th>
          <th>Summary</th>
          <th>Action</th>
        </tr>
      </thead>
      <tbody><tr><td>&#26032;&#32534;&#36158;&#27663;&#22937;&#25506;&#20043;&#65288;20&#65289;&#22899;&#20154;&#23682;&#26159;&#22909;&#24825;&#30340; Kept Women Can&#65292;t Quit</td><td>&#36158;&#24503;&#35834;</td><td>&#39118;&#20113;&#26102;&#20195;</td><td>288</td><td>2023</td><td>&#8251;&#32654;&#22269;&#26377;&#21490;&#20197;&#26469;&#26368;&#22909;&#30340;&#20390;&#25506;&#23567;&#35828;&#65292;&#24403;&#20195;&#32654;&#22269;&#20390;&#25506;&#23567;&#35828;&#22823;&#24072;&#36158;&#24503;&#35834;&#26368;&#24341;&#20197;&#20026;&#20658;&#30340;&#20316;&#21697;
&#8251;&#20197;&#12298;&#26757;&#26862;&#25506;&#26696;&#12299;&#38395;&#21517;&#20840;&#29699;&#65292;&#24403;&#20195;&#32654;&#22269;&#20390;&#25506;&#23567;&#35828;&#22823;&#24072;&#36158;&#24503;&#35834;&#26368;&#24471;&#24847;&#20043;&#20316;
&#8251;&#32654;&#22269;&#20070;&#35780;&#23478;&#65306;&#12300;&#36158;&#24503;&#35834;&#25152;&#21019;&#36896;&#30340;&#22937;&#25506;&#22855;&#26696;&#31995;&#21015;&#65292;&#26159;&#32654;&#22269;&#26377;&#21490;&#20197;&#26469;&#26368;&#22909;&#30340;&#20390;&#25506;&#23567;&#35828;&#12290;&#21333;&#23601;&#19968;&#20214;&#20107;&#23601;&#21313;&#20998;&#38590;&#24471;&#9472;&#9472;&#26607;&#30333;&#33678;&#21644;&#36182;&#21776;&#35834;&#30495;&#26159;&#32477;&#37197;&#65281;&#12301;
&#8251;&#36158;&#24503;&#35834;&#19982;&#33521;&#22269;&#26368;&#33879;&#21517;&#30340;&#20390;&#25506;&#25512;&#29702;&#20316;&#23478;&#38463;&#22025;&#27801;&#65294;&#20811;&#33673;&#19997;&#33922;&#26159;&#21516;&#26102;&#20195;&#20154;&#29289;&#65292;&#19968;&#33324;&#24120;&#35782;&#38750;&#24120;&#20016;&#23500;&#30340;&#19987;&#19994;&#20390;&#25506;&#25512;&#29702;&#23567;&#35828;&#23478;&#12290;
&#8251;&#24403;&#20195;&#32654;&#22269;&#20390;&#25506;&#23567;&#35828;&#30340;&#22823;&#24072;&#65292;&#27627;&#26080;&#30097;&#38382;&#65292;&#24212;&#23646;&#20197;&#12300;&#26757;&#26862;&#25506;&#26696;&#12301;&#31995;&#21015;&#36720;&#21160;&#20102;&#19990;&#30028;&#25991;&#22363;&#30340;&#36158;&#24503;&#35834;&#65288;E. Stanley Gardner&#65289;&#26368;&#20855;&#20195;&#34920;&#24615;&#12290;&#20294;&#20107;&#23454;&#19978;&#65292;&#12300;&#26757;&#26862;&#25506;&#26696;&#12301;&#24182;&#19981;&#26159;&#36158;&#27663;&#26368;&#24341;&#20197;&#20026;&#20658;&#30340;&#20316;&#21697;&#65292;&#22240;&#20026;&#36158;&#27663;&#26412;&#20154;&#26366;&#19968;&#20877;&#24378;&#35843;&#65306;&#12300;&#22937;&#25506;&#22855;&#26696;&#31995;&#21015;&#12301;&#25165;&#26159;&#20182;&#20197;&#31070;&#26469;&#20043;&#31508;&#21019;&#20316;&#30340;&#20390;&#25506;&#23567;&#35828;&#24005;&#23792;&#25104;&#26524;&#12290;&#12300;&#22937;&#25506;&#22855;&#26696;&#31995;&#21015;&#12301;&#20013;&#30340;&#30007;&#22899;&#20027;&#35282;&#36182;&#21776;&#35834;&#19982;&#26607;&#30333;&#33678;&#65292;&#22996;&#23454;&#26159;&#22937;&#19981;&#21487;&#35328;&#30340;&#20154;&#29289;&#65292;&#26497;&#20855;&#36259;&#21619;&#24863;&#12289;&#29616;&#20195;&#24863;&#19982;&#20154;&#24615;&#33394;&#24425;&#65307;&#32780;&#27599;&#19968;&#26412;&#25925;&#20107;&#21448;&#37117;&#39640;&#28526;&#36845;&#36215;&#65292;&#19997;&#19997;&#20837;&#25187;&#65292;&#35753;&#20154;&#35835;&#26469;&#29233;&#19981;&#24525;&#37322;&#65292;&#22570;&#31216;&#26159;&#21035;&#24320;&#29983;&#38754;&#30340;&#20390;&#25506;&#26480;&#20316;&#12290;

&#36158;&#27663;&#12300;&#22937;&#25506;&#22855;&#26696;&#31995;&#21015;&#12301;&#65292;&#65288;Bertha Cool&#9472;Donald Lanm Mystery&#65289;&#31532;&#19968;&#37096;&#12298;&#26469;&#21183;&#27769;&#27769;&#12299;&#22312;&#32654;&#22269;&#20986;&#29256;&#30340;&#26102;&#20505;&#65292;&#20316;&#32773;&#29992;&#30340;&#31508;&#21517;&#26159;&#12300;&#36153;&#23572;&#12301;&#65288;AA Fair&#65289;&#12290;&#20960;&#20010;&#26376;&#20043;&#21518;&#65292;&#24341;&#36215;&#20102;&#32654;&#22269;&#24459;&#24072;&#30028;&#12289;&#21496;&#27861;&#30028;&#26497;&#22823;&#30340;&#38663;&#21160;&#12290;

&#30475;&#20284;&#30334;&#33324;&#19981;&#25645;&#65292;&#21364;&#21448;&#24847;&#22806;&#21512;&#25293;&#30340;&#20390;&#25506;&#25645;&#25377;
&#25925;&#20107;&#24773;&#33410;&#31934;&#24515;&#24067;&#23616;&#65292;&#32039;&#24352;&#22788;&#20196;&#20154;&#36879;&#19981;&#36807;&#27668;

&#20182;&#20204;&#19981;&#26159;&#20426;&#30007;&#32654;&#22899;&#37197;&#65292;&#20063;&#19981;&#26159;&#24535;&#21516;&#36947;&#21512;&#30340;&#20249;&#20276;&#65292;&#20182;&#20204;&#29978;&#33267;&#23545;&#24456;&#22810;&#20107;&#29289;&#30340;&#30475;&#27861;&#23436;&#20840;&#30456;&#21453;&#65292;&#23588;&#20854;&#26159;&#23545;&#32654;&#22899;&#30340;&#30475;&#27861;&#12290;&#28982;&#32780;&#65292;&#20182;&#20204;&#21364;&#26159;&#27704;&#36828;&#30340;&#20390;&#25506;&#32477;&#37197;&#65281;
        
&#21448;&#32982;&#21448;&#29233;&#38065;&#30340;&#26607;&#30333;&#33678;&#21644;&#21448;&#24178;&#30250;&#21448;&#31934;&#26126;&#30340;&#36182;&#21776;&#35834;&#26159;&#26607;&#27663;&#31169;&#23478;&#20390;&#25506;&#31038;&#30340;&#32769;&#26495;&#19982;&#21592;&#24037;&#65292;&#36182;&#21776;&#35834;&#24418;&#23481;&#26607;&#30333;&#33678;&#20687;&#19968;&#25414;&#24102;&#21050;&#30340;&#38081;&#19997;&#32593;&#65292;&#26607;&#30333;&#33678;&#35828;&#36182;&#21776;&#35834;&#25481;&#22312;&#27700;&#37324;&#25438;&#36215;&#26469;&#65292;&#36830;&#34915;&#26381;&#24102;&#27700;&#19981;&#21040;&#19968;&#30334;&#19977;&#21313;&#30917;&#12290;
&#26607;&#30333;&#33678;&#25105;&#34892;&#25105;&#32032;&#65292;&#19981;&#35762;&#31350;&#34915;&#30528;&#65292;&#19981;&#22312;&#24847;&#20307;&#37325;&#65292;&#35201;&#22905;&#25487;&#20986;&#38065;&#27604;&#35201;&#22905;&#30340;&#21629;&#36824;&#30171;&#33510;&#12290;
&#36182;&#21776;&#35834;&#27861;&#23398;&#38498;&#27605;&#19994;&#65292;&#38752;&#31934;&#36890;&#27861;&#24459;&#24120;&#35782;&#65292;&#22312;&#27861;&#24459;&#36793;&#32536;&#34180;&#20912;&#19978;&#28316;&#26469;&#28316;&#21435;&#12290;
&#28316;&#24471;&#21512;&#20249;&#20154;&#24597;&#24597;&#65292;&#35686;&#23519;&#24680;&#24680;&#65292;&#20248;&#28857;&#26159;&#23545;&#24403;&#20107;&#20154;&#27704;&#36828;&#24544;&#24515;&#12290;

&#19968;&#23447;&#31070;&#31192;&#36816;&#38046;&#36710;&#25250;&#26696;
&#28040;&#22833;&#30340;&#20116;&#19975;&#20803;&#32654;&#37329;
&#32654;&#22899;&#21475;&#20013;&#38590;&#20197;&#32622;&#20449;&#30340;&#25925;&#20107;
&#21776;&#35834;&#35813;&#22914;&#20309;&#30772;&#26696;&#65281;

&#22996;&#25176;&#20154;&#65306;&#31461;&#28023;&#19997;&#65288;&#19968;&#20010;&#36523;&#26448;&#32654;&#22937;&#30340;&#22825;&#29983;&#23588;&#29289;&#65292;&#26159;&#23443;&#21892;&#27004;&#35686;&#23448;&#20840;&#21147;&#36861;&#32521;&#30340;&#36816;&#38046;&#36710;&#25250;&#26696;&#20849;&#29359;&#65289;
&#29305;&#21035;&#20219;&#21153;&#65306;&#25214;&#22238;&#34987;&#12300;&#19976;&#22827;&#12301;&#31461;&#36798;&#21033;&#22353;&#25481;&#30340;&#20116;&#19975;&#20803;

&#9678;&#26696;&#20214;&#29366;&#20917;&#65306;
&#23443;&#21892;&#27004;&#35686;&#23448;&#22312;&#35843;&#26597;&#19968;&#23447;&#31070;&#31192;&#36816;&#38046;&#36710;&#25250;&#26696;&#26102;&#65292;&#34429;&#39034;&#21033;&#25235;&#21040;&#20102;&#23244;&#29359;&#65292;&#21364;&#20002;&#22833;&#20102;&#20116;&#19975;&#20803;&#30340;&#36156;&#36163;&#65292;&#21517;&#35465;&#25195;&#22320;&#12290;&#20182;&#26681;&#25454;&#23244;&#29359;&#26368;&#21518;&#25171;&#30340;&#19968;&#36890;&#30005;&#35805;&#30447;&#19978;&#20102;&#31461;&#28023;&#19997;&#65292;&#24182;&#22312;&#22905;&#23478;&#20013;&#25628;&#21040;&#20102;&#26607;&#36182;&#20108;&#27663;&#30340;&#30005;&#35805;&#12290;&#30475;&#21040;&#21776;&#35834;&#23601;&#22836;&#30171;&#30340;&#23443;&#35686;&#23448;&#24819;&#38459;&#27490;&#21776;&#35834;&#25509;&#21463;&#31461;&#28023;&#19997;&#30340;&#22996;&#25176;&#65292;&#23601;&#22312;&#27492;&#26102;&#65292;&#31461;&#28023;&#19997;&#24708;&#24708;&#28316;&#36827;&#20102;&#20390;&#25506;&#31038;&#65292;&#22905;&#35753;&#21776;&#35834;&#30524;&#30555;&#21507;&#36275;&#20102;&#20912;&#28103;&#28107;&#65292;&#21364;&#20063;&#21578;&#35785;&#21776;&#35834;&#19968;&#21017;&#24456;&#38590;&#30456;&#20449;&#30340;&#25925;&#20107;……

&#8251;&#12304;&#26607;&#27663;&#31169;&#23478;&#20390;&#25506;&#31038;&#12305;&#21517;&#35328;&#22937;&#35821;&#65306;
&#26607;&#30333;&#33678;&#26159;&#22905;&#30340;&#21517;&#23383;&#65292;&#22905;&#36523;&#20307;&#30340;&#22806;&#22411;&#65292;&#20197;&#21450;&#22362;&#24378;&#30340;&#20307;&#33021;&#12289;&#20010;&#24615;&#65292;&#23601;&#20687;&#19968;&#25414;&#20570;&#31729;&#31494;&#30340;&#26377;&#21050;&#38081;&#19997;&#32593;&#65292;&#25165;&#20174;&#24037;&#21378;&#20986;&#26469;&#65292;&#38543;&#26102;&#20934;&#22791;&#19978;&#33337;&#22806;&#38144;&#12290;</td><td><button>Delete</button></td></tr></tbody>
    </table>

    <br>

    <div>
      <label>Total Books: </label>
      <span id="totalBooks">1</span>
    </div>
    <div>
      <label>Average Pages: </label>
      <span id="avgPages">288</span>
    </div>

    <script>
      var books = JSON.parse(localStorage.getItem("books") || "[]");

      displayBooks();

      function addBook() {
        var title = document.getElementById("titleInput").value;
        var author = document.getElementById("authorInput").value;
        var publisher = document.getElementById("publisherInput").value;
        var pages = document.getElementById("pagesInput").value;
        var year = document.getElementById("yearInput").value;
        var summary = document.getElementById("summaryInput").value;

        var book = {
          title: title,
          author: author,
          publisher: publisher,
          pages: pages,
          year: year,
          summary: summary,
        };

        books.push(book);
        localStorage.setItem("books", JSON.stringify(books));

        displayBooks();
        clearForm();
        return false;
      }

      function clearForm() {
        document.getElementById("titleInput").value = "";
        document.getElementById("authorInput").value = "";
        document.getElementById("publisherInput").value = "";
        document.getElementById("pagesInput").value = "";
        document.getElementById("yearInput").value = "";
        document.getElementById("summaryInput").value = "";
      }

      function displayBooks() {
        var tableBody = document.getElementById(
          "bookTable"
        ).getElementsByTagName("tbody")[0];
        tableBody.innerHTML = "";

        for (var i = 0; i < books.length; i++) {
          var row = tableBody.insertRow(i);

          var titleCell = row.insertCell(0);
          titleCell.innerHTML = books[i].title;

          var authorCell = row.insertCell(1);
          authorCell.innerHTML = books[i].author;

          var publisherCell = row      .insertCell(2);
      publisherCell.innerHTML = books[i].publisher;

      var pagesCell = row.insertCell(3);
      pagesCell.innerHTML = books[i].pages;

      var yearCell = row.insertCell(4);
      yearCell.innerHTML = books[i].year;

      var summaryCell = row.insertCell(5);
      summaryCell.innerHTML = books[i].summary;

      var actionCell = row.insertCell(6);
      var deleteButton = document.createElement("button");
      deleteButton.innerHTML = "Delete";
      deleteButton.onclick = (function (index) {
        return function () {
          deleteBook(index);
        };
      })(i);
      actionCell.appendChild(deleteButton);
    }

    updateStats();
  }

  function deleteBook(index) {
    books.splice(index, 1);
    localStorage.setItem("books", JSON.stringify(books));
    displayBooks();
  }

  function searchBook() {
    var searchInput = document.getElementById("searchInput");
    var filter = searchInput.value.toUpperCase();
    var tableBody = document.getElementById(
      "bookTable"
    ).getElementsByTagName("tbody")[0];
    var rows = tableBody.getElementsByTagName("tr");

    for (var i = 0; i < rows.length; i++) {
      var title = rows[i].getElementsByTagName("td")[0];
      if (title.innerHTML.toUpperCase().indexOf(filter) > -1) {
        rows[i].style.display = "";
      } else {
        rows[i].style.display = "none";
      }
    }
  }

  function updateStats() {
    var totalBooks = document.getElementById("totalBooks");
    var avgPages = document.getElementById("avgPages");

    totalBooks.innerHTML = books.length;

    var sum = 0;
    for (var i = 0; i < books.length; i++) {
      sum += parseInt(books[i].pages);
    }
    avgPages.innerHTML = Math.round(sum / books.length);
  }
    </script>
  
</body></html>